flatPlate_TEact_analysis/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
188800
(
0.14
0.14
0.14
0.14
0.14
0.14
0.14
0.14
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            freestream;
        freestreamValue uniform 0.14;
        value           uniform 0.14;
    }
    up
    {
        type            symmetryPlane;
    }
    left
    {
        type            freestream;
        freestreamValue uniform 0.14;
        value           uniform 0.14;
    }
    cylinder
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    cover
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
